Revit 2027 API
FailureDefinitionId Class
 The unique identifier of a FailureDefinition.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GuidEnum
 Autodesk.Revit.DB.FailureDefinitionId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FailureDefinitionId : GuidEnum
Public Class FailureDefinitionId
	Inherits GuidEnum
public ref class FailureDefinitionId : public GuidEnum
type FailureDefinitionId =
    class
        inherit GuidEnum
    end
The FailureDefinitionId type exposes the following members.
Constructors
Name | Description
FailureDefinitionId | Creates a new FailureDefinitionId instance.
Top
Properties
Name | Description
Guid |  The Guid of GUID-based enum object.
(Inherited from GuidEnum)
Top
Methods
Name | Description
Equals |  Compares two Guid-based enum object based on their concrete class and GUID value.
(Inherited from GuidEnum)
GetHashCode |  Generates a hash code for this Guid-based enum object.
(Inherited from GuidEnum)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Operators
Name | Description
Equality(FailureDefinitionId, FailureDefinitionId) | Compares two FailureDefinitionId instances.
Inequality(FailureDefinitionId, FailureDefinitionId) | Compares two FailureDefinitionId instances.
Top
Remarks
 Each possible failure in Revit must be defined and registered during Revit application startup by creating a FailureDefinition object. Unique FailureDefinitionId must be used as a key to register FailureDefinition. Those unique FailureDefinitionId should be created using GUID generation tool. Later FailureDefinitionId can be used to lookup FailureDefinition in FailureDefinitionRegistry, and create and post FailureMessages.
See Also
Reference
Autodesk.Revit.DB Namespace